{
    "Religious Leaders": [
      {
        "name": "Guru Nanak Dev Ji",
        "image": "/gurus/sg1.jpg",
        "description": "Guru Nanak Dev Ji founded Sikhism in the late 15th century, traveling thousands of miles to spread a message of equality and devotion to one God. He composed hymns that emphasize social justice, community service, and the inner spiritual life. His teachings laid the foundation for a faith that rejects caste distinctions and ritualism."
      },
      {
        "name": "Guru Angad Dev Ji",
        "image": "/gurus/sg2.jpg",
        "description": "Guru Angad Dev Ji was the second Sikh Guru and a devoted disciple of Guru Nanak. He standardized and promoted the Gurmukhi script, making Sikh scripture accessible to the common people. He also institutionalized community kitchens (langar) and emphasized physical education and health through wrestling akharas."
      },
      {
        "name": "Guru Amar Das Ji",
        "image": "/gurus/sg3.jpg",
        "description": "Guru Amar Das Ji, the third Sikh Guru, strengthened the Sikh community by formalizing the practice of langar and insisting on social reforms like freeing women from veil and sati. He instituted the manji system—an early network of congregational leaders—to decentralize spiritual authority. His compassionate leadership underscored equality across gender, caste, and creed."
      },
      {
        "name": "Guru Ram Das Ji",
        "image": "/gurus/sg4.jpg",
        "description": "Guru Ram Das Ji, the fourth Sikh Guru, founded the city of Amritsar and supervised the digging of its sacred pool (Amrit Sarovar). He composed hymns of humility and divine love, several of which appear in the Guru Granth Sahib. Under his guidance, the young Sikh community began crystallizing into both a spiritual fellowship and a growing social institution."
      },
      {
        "name": "Guru Arjan Dev Ji",
        "image": "/gurus/sg5.jpg",
        "description": "Guru Arjan Dev Ji, the fifth Sikh Guru, compiled the Adi Granth—the first edition of what became the Guru Granth Sahib—and installed it in the Harmandir Sahib (Golden Temple). He fostered an open, interfaith ethos by including hymns of Hindu and Muslim saints. His martyrdom under Mughal persecution in 1606 marked the first recorded sacrifice for Sikh faith and inspired later generations."
      },
      {
        "name": "Guru Hargobind Ji",
        "image": "/gurus/sg6.jpg",
        "description": "Guru Hargobind Ji, the sixth Sikh Guru, introduced the concept of Miri-Piri—balancing spiritual authority with temporal power—by donning two swords. He built the Akal Takht as a centre of justice and sovereignty, and openly trained Sikhs in martial arts to defend against tyranny. His leadership transformed the community into both a devotional order and a self-defending brotherhood."
      },
      {
        "name": "Guru Har Rai Ji",
        "image": "/gurus/sg7.jpg",
        "description": "Guru Har Rai Ji, the seventh Sikh Guru, emphasized compassion and healing, maintaining extensive herb gardens and medical clinics at his Manji centres. He continued the martial traditions of his grandfather while also promoting environmental stewardship. His gentle rule focused on charitable works rather than armed conflict, earning him wide respect across communities."
      },
      {
        "name": "Guru Har Krishan Ji",
        "image": "/gurus/sg8.jpg",
        "description": "Guru Har Krishan Ji became the eighth Sikh Guru at just five years old, yet he exemplified remarkable wisdom and humility. During a smallpox epidemic in Delhi, he served the afflicted directly, saying “Baba baksh de”—‘Father, please forgive (the sins of the sick).’ His selfless service and early passing at age eight deepened the Sikhs’ commitment to seva (service)."
      },
      {
        "name": "Guru Tegh Bahadur Ji",
        "image": "/gurus/sg9.jpg",
        "description": "Guru Tegh Bahadur Ji, the ninth Sikh Guru, stood as a champion of religious freedom for all faiths, famously sacrificing his life rather than abandon Kashmiri Pandits facing forced conversion. He traveled extensively to visit remote congregations and spread teachings of inner detachment. His martyrdom in 1675 under Mughal tyranny is remembered as a supreme act of courage and solidarity."
      },
      {
        "name": "Guru Gobind Singh Ji",
        "image": "/gurus/sg10.jpg",
        "description": "Guru Gobind Singh Ji, the tenth Sikh Guru, founded the Khalsa in 1699—a collective of baptized Sikhs dedicated to justice and righteousness—instituting the Five Ks and the double-edged sword (kirpan) as symbols. He was a prolific poet and warrior, defending his people while also composing inspiring shabads (hymns). He declared the Guru Granth Sahib as the eternal Guru before his passing, completing the Sikh Guruship transition to scripture."
      }
    ],
    "Freedom Fighters": [
      {
        "name": "Bhagat Singh",
        "image": "/freedomfighters/bhagatsingh.jpg",
        "description": "Bhagat Singh was a charismatic revolutionary who became a symbol of youth defiance against British colonial rule in India..."
      },
      {
        "name": "Udham Singh",
        "image": "/freedomfighters/udhamsingh.jpg",
        "description": "Udham Singh avenged the 1919 Jallianwala Bagh massacre by traveling to London and assassinating Sir Michael O’Dwyer in 1940..."
      },
      {
        "name": "Kartar Singh Sarabha",
        "image": "/freedomfighters/kartarsingh.jpg",
        "description": "Kartar Singh Sarabha was one of the youngest leaders of the Ghadar Party, advocating armed revolt against British rule during World War I..."
      },
      {
        "name": "Lala Lajpat Rai",
        "image": "/freedomfighters/lalarai.jpg",
        "description": "Lala Lajpat Rai, known as 'Punjab Kesari,' led movements against the Simon Commission in 1928..."
      },
      {
        "name": "Sohan Singh Bhakna",
        "image": "/freedomfighters/sohansingh.jpg",
        "description": "Sohan Singh Bhakna co-founded the Ghadar Party in 1913 to mobilize Indian expatriates in North America for armed rebellion..."
      }
    ],
    "Rulers and Warriors": [
      {
        "name": "Maharaja Ranjit Singh",
        "image": "/rulers/ranjitsingh.jpg",
        "description": "Maharaja Ranjit Singh, the 'Lion of Punjab,' unified the Sikh misls into a powerful Sikh Empire (1799–1839)..."
      },
      {
        "name": "Hari Singh Nalwa",
        "image": "/rulers/harisingh.jpg",
        "description": "Hari Singh Nalwa was Maharaja Ranjit Singh’s greatest general, famed for halting Afghan invasions..."
      },
      {
        "name": "Jassa Singh Ahluwalia",
        "image": "/rulers/jassasingh.jpg",
        "description": "Jassa Singh Ahluwalia led the Ahluwalia misl (confederacy) and played a key role in liberating Delhi’s Golden Temple..."
      },
      {
        "name": "Banda Singh Bahadur",
        "image": "/rulers/bandasingh.jpg",
        "description": "Banda Singh Bahadur was appointed by Guru Gobind Singh Ji to lead Sikhs into Punjab after 1708..."
      },
      {
        "name": "Mai Bhago",
        "image": "/rulers/maibhago.jpg",
        "description": "Mai Bhago was a valiant Sikh woman who led forty deserters back into battle against Mughal forces in 1705..."
      }
    ],
    "Poets and Writers": [
      {
        "name": "Bulleh Shah",
        "image": "/writers/bullehshah.jpg",
        "description": "Bulleh Shah was an 18th-century Punjabi Sufi poet whose kafi verses critique religious orthodoxy..."
      },
      {
        "name": "Waris Shah",
        "image": "/writers/warisshah.jpg",
        "description": "Waris Shah authored the epic poem “Heer Ranjha” in 1766..."
      },
      {
        "name": "Bhai Gurdas Ji",
        "image": "/writers/bhaigurdas.jpg",
        "description": "Bhai Gurdas Ji was a scholar-poet whose vaaran (ballads) provide key commentary on Guru Granth Sahib’s hymns..."
      },
      {
        "name": "Shiv Kumar Batalvi",
        "image": "/writers/shivkumar.jpg",
        "description": "Shiv Kumar Batalvi (1936–1973) was a modern Punjabi poet whose romantic and melancholic verses..."
      },
      {
        "name": "Amrita Pritam",
        "image": "/writers/amritapritam.jpg",
        "description": "Amrita Pritam (1919–2005) was a trailblazing Punjabi writer and poet, best known for her partition novel “Pinjar.”"
      }
    ]
  }
  